stevenj/avr-libc3/include/avr/io/attiny20.h
/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/

typedef struct TC0_struct
{
    register8_t rsv_0x00[21]; /* RESERVED REGISTER BLOCK */
    register8_t OCR0B;        /* Timer/Counter0 Output Compare Register */
    register8_t OCR0A;        /* Timer/Counter0 Output Compare Register */
    register8_t TCNT0;        /* Timer/Counter0 */
    register8_t TCCR0B;       /* Timer/Counter 0 Control Register B */
    register8_t TCCR0A;       /* Timer/Counter 0 Control Register A */
    register8_t rsv_0x1A[11]; /* RESERVED REGISTER BLOCK */
    register8_t TIFR;         /* Overflow Interrupt Enable */
    register8_t TIMSK;        /* Timer Interrupt Mask Register */
    register8_t GTCCR;        /* General Timer/Counter Control Register */
} TC0_t;


/* Compare Output Mode for Channel A bits */
#define TC0_TCCR0A_COM0A_gc(x) ((x<<6) & 0xC0)

/* Compare Output Mode for Channel B bits */
#define TC0_TCCR0A_COM0B_gc(x) ((x<<4) & 0x30)

/* Waveform Generation Mode */
#define TC0_TCCR0A_WGM0_gc(x) (x & 0x03)

/* Force Output Compare A */
typedef enum TC0_FOC0A_enum
{
    TC0_FOC0A_CLEAR_gc = (0x00), /* Force Output Compare A - CLEAR */
    TC0_FOC0A_SET_gc   = (0x80), /* Force Output Compare A - SET */
} TC0_FOC0A_t;

/* Force Output Compare B */
typedef enum TC0_FOC0B_enum
{
    TC0_FOC0B_CLEAR_gc = (0x00), /* Force Output Compare B - CLEAR */
    TC0_FOC0B_SET_gc   = (0x40), /* Force Output Compare B - SET */
} TC0_FOC0B_t;

/* Waveform Generation Mode */
typedef enum TC0_WGM02_enum
{
    TC0_WGM02_CLEAR_gc = (0x00), /* Waveform Generation Mode - CLEAR */
    TC0_WGM02_SET_gc   = (0x08), /* Waveform Generation Mode - SET */
} TC0_WGM02_t;

/* Clock Select */
typedef enum TC0_CS0_enum
{
    TC0_CS0_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC0_CS0_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC0_CS0_VAL_0x02_gc = (0x02), /* Running, CLK/8 */
    TC0_CS0_VAL_0x03_gc = (0x03), /* Running, CLK/64 */
    TC0_CS0_VAL_0x04_gc = (0x04), /* Running, CLK/256 */
    TC0_CS0_VAL_0x05_gc = (0x05), /* Running, CLK/1024 */
    TC0_CS0_VAL_0x06_gc = (0x06), /* Running, ExtClk Tx Falling Edge */
    TC0_CS0_VAL_0x07_gc = (0x07), /* Running, ExtClk Tx Rising Edge */
} TC0_CS0_t;

/* Input Capture Interrupt Enable */
typedef enum TC0_ICIE1_enum
{
    TC0_ICIE1_CLEAR_gc = (0x00), /* Input Capture Interrupt Enable - CLEAR */
    TC0_ICIE1_SET_gc   = (0x80), /* Input Capture Interrupt Enable - SET */
} TC0_ICIE1_t;

/* Output Compare B Match Interrupt Enable */
typedef enum TC0_OCIE1B_enum
{
    TC0_OCIE1B_CLEAR_gc = (0x00), /* Output Compare B Match Interrupt Enable - CLEAR */
    TC0_OCIE1B_SET_gc   = (0x20), /* Output Compare B Match Interrupt Enable - SET */
} TC0_OCIE1B_t;

/* Output Compare A Match Interrupt Enable */
typedef enum TC0_OCIE1A_enum
{
    TC0_OCIE1A_CLEAR_gc = (0x00), /* Output Compare A Match Interrupt Enable - CLEAR */
    TC0_OCIE1A_SET_gc   = (0x10), /* Output Compare A Match Interrupt Enable - SET */
} TC0_OCIE1A_t;

/* Overflow Interrupt Enable */
#define TC0_TIMSK_TOIE_gc(x) (x & 0x09)

/* Timer/Counter Output Compare Match B Interrupt Enable */
typedef enum TC0_OCIE0B_enum
{
    TC0_OCIE0B_CLEAR_gc = (0x00), /* Timer/Counter Output Compare Match B Interrupt Enable - CLEAR */
    TC0_OCIE0B_SET_gc   = (0x04), /* Timer/Counter Output Compare Match B Interrupt Enable - SET */
} TC0_OCIE0B_t;

/* Timer/Counter0 Output Compare Match A Interrupt Enable */
typedef enum TC0_OCIE0A_enum
{
    TC0_OCIE0A_CLEAR_gc = (0x00), /* Timer/Counter0 Output Compare Match A Interrupt Enable - CLEAR */
    TC0_OCIE0A_SET_gc   = (0x02), /* Timer/Counter0 Output Compare Match A Interrupt Enable - SET */
} TC0_OCIE0A_t;

/* Input Capture Flag */
typedef enum TC0_ICF1_enum
{
    TC0_ICF1_CLEAR_gc = (0x00), /* Input Capture Flag - CLEAR */
    TC0_ICF1_SET_gc   = (0x80), /* Input Capture Flag - SET */
} TC0_ICF1_t;

/* Timer Output Compare Flag 1B */
typedef enum TC0_OCF1B_enum
{
    TC0_OCF1B_CLEAR_gc = (0x00), /* Timer Output Compare Flag 1B - CLEAR */
    TC0_OCF1B_SET_gc   = (0x20), /* Timer Output Compare Flag 1B - SET */
} TC0_OCF1B_t;

/* Timer Output Compare Flag 1A */
typedef enum TC0_OCF1A_enum
{
    TC0_OCF1A_CLEAR_gc = (0x00), /* Timer Output Compare Flag 1A - CLEAR */
    TC0_OCF1A_SET_gc   = (0x10), /* Timer Output Compare Flag 1A - SET */
} TC0_OCF1A_t;

/* Timer Overflow Flag */
#define TC0_TIFR_TOV_gc(x) (x & 0x09)

/* Output Compare Flag 0 B */
typedef enum TC0_OCF0B_enum
{
    TC0_OCF0B_CLEAR_gc = (0x00), /* Output Compare Flag 0 B - CLEAR */
    TC0_OCF0B_SET_gc   = (0x04), /* Output Compare Flag 0 B - SET */
} TC0_OCF0B_t;

/* Output Compare Flag 0 A */
typedef enum TC0_OCF0A_enum
{
    TC0_OCF0A_CLEAR_gc = (0x00), /* Output Compare Flag 0 A - CLEAR */
    TC0_OCF0A_SET_gc   = (0x02), /* Output Compare Flag 0 A - SET */
} TC0_OCF0A_t;

/* Timer Synchronization Mode */
typedef enum TC0_TSM_enum
{
    TC0_TSM_CLEAR_gc = (0x00), /* Timer Synchronization Mode - CLEAR */
    TC0_TSM_SET_gc   = (0x80), /* Timer Synchronization Mode - SET */
} TC0_TSM_t;

/* Prescaler Reset */
typedef enum TC0_PSR_enum
{
    TC0_PSR_CLEAR_gc = (0x00), /* Prescaler Reset - CLEAR */
    TC0_PSR_SET_gc   = (0x01), /* Prescaler Reset - SET */
} TC0_PSR_t;

/*
--------------------------------------------------------------------------------
TWI - Two Wire Serial Interface
--------------------------------------------------------------------------------
*/

typedef struct TWI_struct
{
    register8_t rsv_0x00[40]; /* RESERVED REGISTER BLOCK */
    register8_t TWSD;         /* TWI Slave Data Register */
    register8_t TWSAM;        /* TWI Slave Address Mask Register */
    register8_t TWSA;         /* TWI Slave Address Register */
    register8_t TWSSRA;       /* TWI Slave Status Register A */
    register8_t TWSCRB;       /* TWI Slave Control Register B */
    register8_t TWSCRA;       /* TWI Slave Control Register A */
} TWI_t;


