stevenj/avr-libc3/include/avr/io/attiny20.h
/* Overflow Interrupt Enable */
#define TC1_TIMSK_TOIE_gc(x) (x & 0x09)

/* Timer/Counter Output Compare Match B Interrupt Enable */
typedef enum TC1_OCIE0B_enum
{
    TC1_OCIE0B_CLEAR_gc = (0x00), /* Timer/Counter Output Compare Match B Interrupt Enable - CLEAR */
    TC1_OCIE0B_SET_gc   = (0x04), /* Timer/Counter Output Compare Match B Interrupt Enable - SET */
} TC1_OCIE0B_t;

/* Timer/Counter0 Output Compare Match A Interrupt Enable */
typedef enum TC1_OCIE0A_enum
{
    TC1_OCIE0A_CLEAR_gc = (0x00), /* Timer/Counter0 Output Compare Match A Interrupt Enable - CLEAR */
    TC1_OCIE0A_SET_gc   = (0x02), /* Timer/Counter0 Output Compare Match A Interrupt Enable - SET */
} TC1_OCIE0A_t;

/* Input Capture Flag */
typedef enum TC1_ICF1_enum
{
    TC1_ICF1_CLEAR_gc = (0x00), /* Input Capture Flag - CLEAR */
    TC1_ICF1_SET_gc   = (0x80), /* Input Capture Flag - SET */
} TC1_ICF1_t;

/* Timer Output Compare Flag 1B */
typedef enum TC1_OCF1B_enum
{
    TC1_OCF1B_CLEAR_gc = (0x00), /* Timer Output Compare Flag 1B - CLEAR */
    TC1_OCF1B_SET_gc   = (0x20), /* Timer Output Compare Flag 1B - SET */
} TC1_OCF1B_t;

/* Timer Output Compare Flag 1A */
typedef enum TC1_OCF1A_enum
{
    TC1_OCF1A_CLEAR_gc = (0x00), /* Timer Output Compare Flag 1A - CLEAR */
    TC1_OCF1A_SET_gc   = (0x10), /* Timer Output Compare Flag 1A - SET */
} TC1_OCF1A_t;

/* Timer Overflow Flag */
#define TC1_TIFR_TOV_gc(x) (x & 0x09)

/* Output Compare Flag 0 B */
typedef enum TC1_OCF0B_enum
{
    TC1_OCF0B_CLEAR_gc = (0x00), /* Output Compare Flag 0 B - CLEAR */
    TC1_OCF0B_SET_gc   = (0x04), /* Output Compare Flag 0 B - SET */
} TC1_OCF0B_t;

/* Output Compare Flag 0 A */
typedef enum TC1_OCF0A_enum
{
    TC1_OCF0A_CLEAR_gc = (0x00), /* Output Compare Flag 0 A - CLEAR */
    TC1_OCF0A_SET_gc   = (0x02), /* Output Compare Flag 0 A - SET */
} TC1_OCF0A_t;

/* Timer Synchronization Mode */
typedef enum TC1_TSM_enum
{
    TC1_TSM_CLEAR_gc = (0x00), /* Timer Synchronization Mode - CLEAR */
    TC1_TSM_SET_gc   = (0x80), /* Timer Synchronization Mode - SET */
} TC1_TSM_t;

/* Prescaler Reset */
typedef enum TC1_PSR_enum
{
    TC1_PSR_CLEAR_gc = (0x00), /* Prescaler Reset - CLEAR */
    TC1_PSR_SET_gc   = (0x01), /* Prescaler Reset - SET */
} TC1_PSR_t;

/*
--------------------------------------------------------------------------------
SPI - Serial Peripheral Interface
--------------------------------------------------------------------------------
*/

typedef struct SPI_struct
{
    register8_t rsv_0x00[46]; /* RESERVED REGISTER BLOCK */
    register8_t SPDR;         /* SPI Data Register */
    register8_t SPSR;         /* SPI Status Register */
    register8_t SPCR;         /* SPI Control Register */
} SPI_t;


/* SPI Interrupt Enable */
typedef enum SPI_SPIE_enum
{
    SPI_SPIE_CLEAR_gc = (0x00), /* SPI Interrupt Enable - CLEAR */
    SPI_SPIE_SET_gc   = (0x80), /* SPI Interrupt Enable - SET */
} SPI_SPIE_t;

/* SPI Enable */
typedef enum SPI_SPE_enum
{
    SPI_SPE_CLEAR_gc = (0x00), /* SPI Enable - CLEAR */
    SPI_SPE_SET_gc   = (0x40), /* SPI Enable - SET */
} SPI_SPE_t;

/* Data Order */
typedef enum SPI_DORD_enum
{
    SPI_DORD_CLEAR_gc = (0x00), /* Data Order - CLEAR */
    SPI_DORD_SET_gc   = (0x20), /* Data Order - SET */
} SPI_DORD_t;

/* Master/Slave Select */
typedef enum SPI_MSTR_enum
{
    SPI_MSTR_CLEAR_gc = (0x00), /* Master/Slave Select - CLEAR */
    SPI_MSTR_SET_gc   = (0x10), /* Master/Slave Select - SET */
} SPI_MSTR_t;

/* Clock polarity */
typedef enum SPI_CPOL_enum
{
    SPI_CPOL_CLEAR_gc = (0x00), /* Clock polarity - CLEAR */
    SPI_CPOL_SET_gc   = (0x08), /* Clock polarity - SET */
} SPI_CPOL_t;

/* Clock Phase */
typedef enum SPI_CPHA_enum
{
    SPI_CPHA_CLEAR_gc = (0x00), /* Clock Phase - CLEAR */
    SPI_CPHA_SET_gc   = (0x04), /* Clock Phase - SET */
} SPI_CPHA_t;

/* SPI Clock Rate Selects */
typedef enum SPI_SPR_enum
{
    SPI_SPR_VAL_0x00_gc = (0x00), /* fcl/4 */
    SPI_SPR_VAL_0x01_gc = (0x01), /* fcl/16 */
    SPI_SPR_VAL_0x02_gc = (0x02), /* fcl/64 */
    SPI_SPR_VAL_0x03_gc = (0x03), /* fcl/128 */
} SPI_SPR_t;

/* SPI Interrupt Flag */
typedef enum SPI_SPIF_enum
{
    SPI_SPIF_CLEAR_gc = (0x00), /* SPI Interrupt Flag - CLEAR */
    SPI_SPIF_SET_gc   = (0x80), /* SPI Interrupt Flag - SET */
} SPI_SPIF_t;

/* Write Collision Flag */
typedef enum SPI_WCOL_enum
{
    SPI_WCOL_CLEAR_gc = (0x00), /* Write Collision Flag - CLEAR */
    SPI_WCOL_SET_gc   = (0x40), /* Write Collision Flag - SET */
} SPI_WCOL_t;

/* Double SPI Speed Bit */
typedef enum SPI_SPI2X_enum
{
    SPI_SPI2X_CLEAR_gc = (0x00), /* Double SPI Speed Bit - CLEAR */
    SPI_SPI2X_SET_gc   = (0x01), /* Double SPI Speed Bit - SET */
} SPI_SPI2X_t;
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define PORTB   (*(PORTB_t *) 0x0000)   /* I/O Port */
#define PORTA   (*(PORTA_t *) 0x0000)   /* I/O Port */
#define WDT     (*(WDT_t *) 0x0000)     /* Watchdog Timer */
#define ADC     (*(ADC_t *) 0x0000)     /* Analog-to-Digital Converter */
#define AC      (*(AC_t *) 0x0000)      /* Analog Comparator */
#define CPU     (*(CPU_t *) 0x0000)     /* CPU Registers */
#define EXINT   (*(EXINT_t *) 0x0000)   /* External Interrupts */
#define TC0     (*(TC0_t *) 0x0000)     /* Timer/Counter, 8-bit */
#define TWI     (*(TWI_t *) 0x0000)     /* Two Wire Serial Interface */
#define TC1     (*(TC1_t *) 0x0000)     /* Timer/Counter, 16-bit */
#define SPI     (*(SPI_t *) 0x0000)     /* Serial Peripheral Interface */
#define FUSE    (*(FUSE_t *) 0x0000)    /* Fuses */
#define LOCKBIT (*(LOCKBIT_t *) 0x0000) /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/


