stevenj/avr-libc3/include/avr/io/attiny20.h
/* Power-on Reset Flag */
#define CPU_PORF_CLEAR_gc (0x00) /* Power-on Reset Flag - CLEAR */
#define CPU_PORF_SET_gc   (0x01) /* Power-on Reset Flag - SET */


/* Non-Volatile Memory Busy */
#define CPU_NVMBSY_CLEAR_gc (0x00) /* Non-Volatile Memory Busy - CLEAR */
#define CPU_NVMBSY_SET_gc   (0x80) /* Non-Volatile Memory Busy - SET */


/* BOD Sleep */
#define CPU_BODS_CLEAR_gc (0x00) /* BOD Sleep - CLEAR */
#define CPU_BODS_SET_gc   (0x10) /* BOD Sleep - SET */


/* Sleep Mode */
#define CPU_SM_IDLE_gc  (0x00<<1) /* Idle */
#define CPU_SM_ADC_gc   (0x01<<1) /* ADC noise reduction */
#define CPU_SM_PDOWN_gc (0x02<<1) /* Power-down */
#define CPU_SM_STDBY_gc (0x04<<1) /* Standby */


/* Sleep Enable */
#define CPU_SE_CLEAR_gc (0x00) /* Sleep Enable - CLEAR */
#define CPU_SE_SET_gc   (0x01) /* Sleep Enable - SET */


/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/


/* Interrupt Sense Control 0 Bit 1 */
#define EXINT_ISC01_CLEAR_gc (0x00) /* Interrupt Sense Control 0 Bit 1 - CLEAR */
#define EXINT_ISC01_SET_gc   (0x80) /* Interrupt Sense Control 0 Bit 1 - SET */


/* Interrupt Sense Control 0 Bit 0 */
#define EXINT_ISC00_VAL_0x00_gc (0x00<<6) /* Low Level of INTX */
#define EXINT_ISC00_VAL_0x01_gc (0x01<<6) /* Any logical change on INTX */
#define EXINT_ISC00_VAL_0x02_gc (0x02<<6) /* Falling Edge of INTX */
#define EXINT_ISC00_VAL_0x03_gc (0x03<<6) /* Rising Edge of INTX */


/* Pin Change Interrupt Flags */
#define EXINT_GIFR_PCIF_gc(x) ((x<<4) & 0x30)

/* External Interrupt Flag 0 */
#define EXINT_INTF0_CLEAR_gc (0x00) /* External Interrupt Flag 0 - CLEAR */
#define EXINT_INTF0_SET_gc   (0x01) /* External Interrupt Flag 0 - SET */


/* Pin Change Interrupt Enables */
#define EXINT_GIMSK_PCIE_gc(x) ((x<<4) & 0x30)

/* External Interrupt Request 0 Enable */
#define EXINT_INT0_CLEAR_gc (0x00) /* External Interrupt Request 0 Enable - CLEAR */
#define EXINT_INT0_SET_gc   (0x01) /* External Interrupt Request 0 Enable - SET */


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/


/* Compare Output Mode for Channel A bits */
#define TC0_TCCR0A_COM0A_gc(x) ((x<<6) & 0xC0)

/* Compare Output Mode for Channel B bits */
#define TC0_TCCR0A_COM0B_gc(x) ((x<<4) & 0x30)

/* Waveform Generation Mode */
#define TC0_TCCR0A_WGM0_gc(x) (x & 0x03)

/* Force Output Compare A */
#define TC0_FOC0A_CLEAR_gc (0x00) /* Force Output Compare A - CLEAR */
#define TC0_FOC0A_SET_gc   (0x80) /* Force Output Compare A - SET */


/* Force Output Compare B */
#define TC0_FOC0B_CLEAR_gc (0x00) /* Force Output Compare B - CLEAR */
#define TC0_FOC0B_SET_gc   (0x40) /* Force Output Compare B - SET */


/* Waveform Generation Mode */
#define TC0_WGM02_CLEAR_gc (0x00) /* Waveform Generation Mode - CLEAR */
#define TC0_WGM02_SET_gc   (0x08) /* Waveform Generation Mode - SET */


/* Clock Select */
#define TC0_CS0_VAL_0x00_gc (0x00) /* No Clock Source (Stopped) */
#define TC0_CS0_VAL_0x01_gc (0x01) /* Running, No Prescaling */
#define TC0_CS0_VAL_0x02_gc (0x02) /* Running, CLK/8 */
#define TC0_CS0_VAL_0x03_gc (0x03) /* Running, CLK/64 */
#define TC0_CS0_VAL_0x04_gc (0x04) /* Running, CLK/256 */
#define TC0_CS0_VAL_0x05_gc (0x05) /* Running, CLK/1024 */
#define TC0_CS0_VAL_0x06_gc (0x06) /* Running, ExtClk Tx Falling Edge */
#define TC0_CS0_VAL_0x07_gc (0x07) /* Running, ExtClk Tx Rising Edge */


/* Input Capture Interrupt Enable */
#define TC0_ICIE1_CLEAR_gc (0x00) /* Input Capture Interrupt Enable - CLEAR */
#define TC0_ICIE1_SET_gc   (0x80) /* Input Capture Interrupt Enable - SET */


/* Output Compare B Match Interrupt Enable */
#define TC0_OCIE1B_CLEAR_gc (0x00) /* Output Compare B Match Interrupt Enable - CLEAR */
#define TC0_OCIE1B_SET_gc   (0x20) /* Output Compare B Match Interrupt Enable - SET */


/* Output Compare A Match Interrupt Enable */
#define TC0_OCIE1A_CLEAR_gc (0x00) /* Output Compare A Match Interrupt Enable - CLEAR */
#define TC0_OCIE1A_SET_gc   (0x10) /* Output Compare A Match Interrupt Enable - SET */


/* Overflow Interrupt Enable */
#define TC0_TIMSK_TOIE_gc(x) (x & 0x09)

/* Timer/Counter Output Compare Match B Interrupt Enable */
#define TC0_OCIE0B_CLEAR_gc (0x00) /* Timer/Counter Output Compare Match B Interrupt Enable - CLEAR */
#define TC0_OCIE0B_SET_gc   (0x04) /* Timer/Counter Output Compare Match B Interrupt Enable - SET */


/* Timer/Counter0 Output Compare Match A Interrupt Enable */
#define TC0_OCIE0A_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Match A Interrupt Enable - CLEAR */
#define TC0_OCIE0A_SET_gc   (0x02) /* Timer/Counter0 Output Compare Match A Interrupt Enable - SET */


/* Input Capture Flag */
#define TC0_ICF1_CLEAR_gc (0x00) /* Input Capture Flag - CLEAR */
#define TC0_ICF1_SET_gc   (0x80) /* Input Capture Flag - SET */


/* Timer Output Compare Flag 1B */
#define TC0_OCF1B_CLEAR_gc (0x00) /* Timer Output Compare Flag 1B - CLEAR */
#define TC0_OCF1B_SET_gc   (0x20) /* Timer Output Compare Flag 1B - SET */


/* Timer Output Compare Flag 1A */
#define TC0_OCF1A_CLEAR_gc (0x00) /* Timer Output Compare Flag 1A - CLEAR */
#define TC0_OCF1A_SET_gc   (0x10) /* Timer Output Compare Flag 1A - SET */


/* Timer Overflow Flag */
#define TC0_TIFR_TOV_gc(x) (x & 0x09)

/* Output Compare Flag 0 B */
#define TC0_OCF0B_CLEAR_gc (0x00) /* Output Compare Flag 0 B - CLEAR */
#define TC0_OCF0B_SET_gc   (0x04) /* Output Compare Flag 0 B - SET */


/* Output Compare Flag 0 A */
#define TC0_OCF0A_CLEAR_gc (0x00) /* Output Compare Flag 0 A - CLEAR */
#define TC0_OCF0A_SET_gc   (0x02) /* Output Compare Flag 0 A - SET */


/* Timer Synchronization Mode */
#define TC0_TSM_CLEAR_gc (0x00) /* Timer Synchronization Mode - CLEAR */
#define TC0_TSM_SET_gc   (0x80) /* Timer Synchronization Mode - SET */


/* Prescaler Reset */
#define TC0_PSR_CLEAR_gc (0x00) /* Prescaler Reset - CLEAR */
#define TC0_PSR_SET_gc   (0x01) /* Prescaler Reset - SET */


