stevenj/avr-libc3/include/avr/io/attiny20.h
/*
--------------------------------------------------------------------------------
SPI - Serial Peripheral Interface
--------------------------------------------------------------------------------
*/


/* SPI Interrupt Enable */
#define SPI_SPIE_CLEAR_gc (0x00) /* SPI Interrupt Enable - CLEAR */
#define SPI_SPIE_SET_gc   (0x80) /* SPI Interrupt Enable - SET */


/* SPI Enable */
#define SPI_SPE_CLEAR_gc (0x00) /* SPI Enable - CLEAR */
#define SPI_SPE_SET_gc   (0x40) /* SPI Enable - SET */


/* Data Order */
#define SPI_DORD_CLEAR_gc (0x00) /* Data Order - CLEAR */
#define SPI_DORD_SET_gc   (0x20) /* Data Order - SET */


/* Master/Slave Select */
#define SPI_MSTR_CLEAR_gc (0x00) /* Master/Slave Select - CLEAR */
#define SPI_MSTR_SET_gc   (0x10) /* Master/Slave Select - SET */


/* Clock polarity */
#define SPI_CPOL_CLEAR_gc (0x00) /* Clock polarity - CLEAR */
#define SPI_CPOL_SET_gc   (0x08) /* Clock polarity - SET */


/* Clock Phase */
#define SPI_CPHA_CLEAR_gc (0x00) /* Clock Phase - CLEAR */
#define SPI_CPHA_SET_gc   (0x04) /* Clock Phase - SET */


/* SPI Clock Rate Selects */
#define SPI_SPR_VAL_0x00_gc (0x00) /* fcl/4 */
#define SPI_SPR_VAL_0x01_gc (0x01) /* fcl/16 */
#define SPI_SPR_VAL_0x02_gc (0x02) /* fcl/64 */
#define SPI_SPR_VAL_0x03_gc (0x03) /* fcl/128 */


/* SPI Interrupt Flag */
#define SPI_SPIF_CLEAR_gc (0x00) /* SPI Interrupt Flag - CLEAR */
#define SPI_SPIF_SET_gc   (0x80) /* SPI Interrupt Flag - SET */


/* Write Collision Flag */
#define SPI_WCOL_CLEAR_gc (0x00) /* Write Collision Flag - CLEAR */
#define SPI_WCOL_SET_gc   (0x40) /* Write Collision Flag - SET */


/* Double SPI Speed Bit */
#define SPI_SPI2X_CLEAR_gc (0x00) /* Double SPI Speed Bit - CLEAR */
#define SPI_SPI2X_SET_gc   (0x01) /* Double SPI Speed Bit - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0004) /* Port B Data register */
#define PORTBB_DDRB     _SFR_MEM8 (0x0005) /* Data Direction Register, Port B */
#define PORTBB_PORTB    _SFR_MEM8 (0x0006) /* Input Pins, Port B */
#define PORTBB_PUEB     _SFR_MEM8 (0x0007) /* Pull-up Enable Control Register */
#define PORTBB_PORTCR   _SFR_MEM8 (0x0008) /* Port Control Register */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE     _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA     _SFR_MEM8 (0x0000) /* Port A Input Pins */
#define PORTAA_DDRA     _SFR_MEM8 (0x0001) /* Data Direction Register, Port A */
#define PORTAA_PORTA    _SFR_MEM8 (0x0002) /* Port A Data Register */
#define PORTAA_PUEA     _SFR_MEM8 (0x0003) /* Pull-up Enable Control Register */
#define PORTAA_PORTCR   _SFR_MEM8 (0x0008) /* Port Control Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR      _SFR_MEM8 (0x0031) /* Watchdog Timer Control and Status Register */

/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE        _SFR_MEM8 (0x0000) /* ADC Base Address */
#define ADC_DIDR0       _SFR_MEM8 (0x000D) /* Digital Input Disable Register 0 */
#define ADC_ADC         _SFR_MEM16(0x000E) /* ADC Data Register  Bytes */
#define ADC_ADCL        _SFR_MEM8 (0x000E) /* ADC Data Register  Bytes LOW BYTE */
#define ADC_ADCH        _SFR_MEM8 (0x000F) /* ADC Data Register  Bytes HIGH BYTE */
#define ADC_ADMUX       _SFR_MEM8 (0x0010) /* The ADC multiplexer Selection Register */
#define ADC_ADCSRB      _SFR_MEM8 (0x0011) /* ADC Control and Status Register B */
#define ADC_ADCSRA      _SFR_MEM8 (0x0012) /* The ADC Control and Status register */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE         _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_ACSRB        _SFR_MEM8 (0x0013) /* Analog Comparator Control And Status Register B */
#define AC_ACSRA        _SFR_MEM8 (0x0014) /* Analog Comparator Control And Status Register A */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_NVMCSR      _SFR_MEM8 (0x0032) /* Non-Volatile Memory Control and Status Register */
#define CPU_NVMCMD      _SFR_MEM8 (0x0033) /* Non-Volatile Memory Command */
#define CPU_PRR         _SFR_MEM8 (0x0035) /* Power Reduction Register */
#define CPU_CLKPSR      _SFR_MEM8 (0x0036) /* Clock Prescale Register */
#define CPU_CLKMSR      _SFR_MEM8 (0x0037) /* Clock Main Settings Register */
#define CPU_OSCCAL      _SFR_MEM8 (0x0039) /* Oscillator Calibration Value */
#define CPU_MCUCR       _SFR_MEM8 (0x003A) /* MCU Control Register */
#define CPU_RSTFLR      _SFR_MEM8 (0x003B) /* Reset Flag Register */
#define CPU_CCP         _SFR_MEM8 (0x003C) /* Configuration Change Protection */
#define CPU_SP          _SFR_MEM16(0x003D) /* Stack Pointer  */
#define CPU_SPL         _SFR_MEM8 (0x003D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH         _SFR_MEM8 (0x003E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG        _SFR_MEM8 (0x003F) /* Status Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK0    _SFR_MEM8 (0x0009) /* Pin Change Mask Register 0 */
#define EXINT_PCMSK1    _SFR_MEM8 (0x000A) /* Pin Change Mask Register 1 */
#define EXINT_GIFR      _SFR_MEM8 (0x000B) /* General Interrupt Flag Register */
#define EXINT_GIMSK     _SFR_MEM8 (0x000C) /* General Interrupt Mask Register */
#define EXINT_MCUCR     _SFR_MEM8 (0x003A) /* MCU Control Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE        _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_OCR0B       _SFR_MEM8 (0x0015) /* Timer/Counter0 Output Compare Register */
#define TC8_OCR0A       _SFR_MEM8 (0x0016) /* Timer/Counter0 Output Compare Register */
#define TC8_TCNT0       _SFR_MEM8 (0x0017) /* Timer/Counter0 */
#define TC8_TCCR0B      _SFR_MEM8 (0x0018) /* Timer/Counter 0 Control Register B */
#define TC8_TCCR0A      _SFR_MEM8 (0x0019) /* Timer/Counter 0 Control Register A */
#define TC8_TIFR        _SFR_MEM8 (0x0025) /* Overflow Interrupt Enable */
#define TC8_TIMSK       _SFR_MEM8 (0x0026) /* Timer Interrupt Mask Register */
#define TC8_GTCCR       _SFR_MEM8 (0x0027) /* General Timer/Counter Control Register */

