stevenj/avr-libc3/include/avr/io/attiny20.h
/* TWI - Two Wire Serial Interface (0x0000) */
#define TWI_BASE        _SFR_MEM8 (0x0000) /* TWI Base Address */
#define TWI_TWSD        _SFR_MEM8 (0x0028) /* TWI Slave Data Register */
#define TWI_TWSAM       _SFR_MEM8 (0x0029) /* TWI Slave Address Mask Register */
#define TWI_TWSA        _SFR_MEM8 (0x002A) /* TWI Slave Address Register */
#define TWI_TWSSRA      _SFR_MEM8 (0x002B) /* TWI Slave Status Register A */
#define TWI_TWSCRB      _SFR_MEM8 (0x002C) /* TWI Slave Control Register B */
#define TWI_TWSCRA      _SFR_MEM8 (0x002D) /* TWI Slave Control Register A */

/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE       _SFR_MEM16(0x0000) /* TC16 Base Address */
#define TC16_ICR1       _SFR_MEM16(0x001A) /* Input Capture Register  Bytes */
#define TC16_ICR1L      _SFR_MEM8 (0x001A) /* Input Capture Register  Bytes LOW BYTE */
#define TC16_ICR1H      _SFR_MEM8 (0x001B) /* Input Capture Register  Bytes HIGH BYTE */
#define TC16_OCR1B      _SFR_MEM16(0x001C) /* Timer/Counter1 Output Compare Register B  */
#define TC16_OCR1BL     _SFR_MEM8 (0x001C) /* Timer/Counter1 Output Compare Register B  LOW BYTE */
#define TC16_OCR1BH     _SFR_MEM8 (0x001D) /* Timer/Counter1 Output Compare Register B  HIGH BYTE */
#define TC16_OCR1A      _SFR_MEM16(0x001E) /* Timer/Counter 1 Output Compare Register A  */
#define TC16_OCR1AL     _SFR_MEM8 (0x001E) /* Timer/Counter 1 Output Compare Register A  LOW BYTE */
#define TC16_OCR1AH     _SFR_MEM8 (0x001F) /* Timer/Counter 1 Output Compare Register A  HIGH BYTE */
#define TC16_TCNT1      _SFR_MEM16(0x0020) /* Timer/Counter1  */
#define TC16_TCNT1L     _SFR_MEM8 (0x0020) /* Timer/Counter1  LOW BYTE */
#define TC16_TCNT1H     _SFR_MEM8 (0x0021) /* Timer/Counter1  HIGH BYTE */
#define TC16_TCCR1C     _SFR_MEM8 (0x0022) /* Timer/Counter1 Control Register C */
#define TC16_TCCR1B     _SFR_MEM8 (0x0023) /* Timer/Counter1 Control Register B */
#define TC16_TCCR1A     _SFR_MEM8 (0x0024) /* Timer/Counter1 Control Register A */
#define TC16_TIFR       _SFR_MEM8 (0x0025) /* Overflow Interrupt Enable */
#define TC16_TIMSK      _SFR_MEM8 (0x0026) /* Timer Interrupt Mask Register */
#define TC16_GTCCR      _SFR_MEM8 (0x0027) /* General Timer/Counter Control Register */

/* SPI - Serial Peripheral Interface (0x0000) */
#define SPI_BASE        _SFR_MEM8 (0x0000) /* SPI Base Address */
#define SPI_SPDR        _SFR_MEM8 (0x002E) /* SPI Data Register */
#define SPI_SPSR        _SFR_MEM8 (0x002F) /* SPI Status Register */
#define SPI_SPCR        _SFR_MEM8 (0x0030) /* SPI Control Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_BYTE0      _SFR_MEM8 (0x0000) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num      (0)                 
#define None_RESET_vect          _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num       (1)                 
#define None_INT0_vect           _VECTOR(1)          /* External Interrupt Request 0 */
#define None_PCINT0_vect_num     (2)                 
#define None_PCINT0_vect         _VECTOR(2)          /* Pin Change Interrupt Request 0 */
#define None_PCINT1_vect_num     (3)                 
#define None_PCINT1_vect         _VECTOR(3)          /* Pin Change Interrupt Request 1 */
#define None_WDT_vect_num        (4)                 
#define None_WDT_vect            _VECTOR(4)          /* Watchdog Time-out */
#define None_TIM1_CAPT_vect_num  (5)                 
#define None_TIM1_CAPT_vect      _VECTOR(5)          /* Timer/Counter1 Input Capture */
#define None_TIM1_COMPA_vect_num (6)                 
#define None_TIM1_COMPA_vect     _VECTOR(6)          /*  Timer/Counter1 Compare Match A */
#define None_TIM1_COMPB_vect_num (7)                 
#define None_TIM1_COMPB_vect     _VECTOR(7)          /*  Timer/Counter1 Compare Match B */
#define None_TIM1_OVF_vect_num   (8)                 
#define None_TIM1_OVF_vect       _VECTOR(8)          /* Timer/Counter1 Overflow */
#define None_TIM0_COMPA_vect_num (9)                 
#define None_TIM0_COMPA_vect     _VECTOR(9)          /* Timer/Counter0 Compare Match A */
#define None_TIM0_COMPB_vect_num (10)                
#define None_TIM0_COMPB_vect     _VECTOR(10)         /* Timer/Counter0 Compare Match B */
#define None_TIM0_OVF_vect_num   (11)                
#define None_TIM0_OVF_vect       _VECTOR(11)         /* Timer/Counter0 Overflow */
#define None_ANA_COMP_vect_num   (12)                
#define None_ANA_COMP_vect       _VECTOR(12)         /* Analog Comparator */
#define None_ADC_ADC_vect_num    (13)                
#define None_ADC_ADC_vect        _VECTOR(13)         /* Conversion Complete */
#define None_TWI_SLAVE_vect_num  (14)                
#define None_TWI_SLAVE_vect      _VECTOR(14)         /* Two-Wire Interface */
#define None_SPI_vect_num        (15)                
#define None_SPI_vect            _VECTOR(15)         /* Serial Peripheral Interface */
#define None_QTRIP_vect_num      (16)                
#define None_QTRIP_vect          _VECTOR(16)         /* Touch Sensing */

/* Vector Table Size */
#define _VECTOR_SIZE             (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE            (17 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x0800)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

